www/system/app/Models/AuthModel.php

    public function login($username)
    {
        return $this->db->table('user')->where([
            'username' => $username
        ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'