www/system/app/Controllers/ChangePassword.php

                return redirect()->to(base_url('/settings/changepassword'));
            } else {
                $password_hash = password_hash($new_password, PASSWORD_DEFAULT);
                $this->ChangePasswordModel->save([
                    'id_user' => session()->get('id_user'),
                    'password' => $password_hash
                ]);
---
UPDATE `user` SET `password` = '$2y$10$MUBihudQiQ0sXkO1qPxqP.hFy3RGfeoijpRR2I4U8Y/x0kgzIII5O'
WHERE `user`.`id_user` IN ('1')